benchmarks/sglang/gpt-oss-120b/A100_tp8_dp1_in4096_out128_p100_c100_3168fa.txt
BENCHMARK: tp8_dp1_in4096_out128_p100_c100_3168fa
================================================================
Command: python -m sglang.bench_serving --port 30000 --model /workspace/gpt-oss-120b --host 127.0.0.1 --backend sglang --dataset-name random --random-input-len 4096 --random-output-len 128 --num-prompts 100 --max-concurrency 100 --request-rate inf --output-file ./benchmark_results_tp8_dp1_A100/tp8_dp1_in4096_out128_p100_c100_3168fa.jsonl --output-details
================================================================

benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='/workspace/gpt-oss-120b', served_model_name=None, tokenizer=None, num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=100, output_file='./benchmark_results_tp8_dp1_A100/tp8_dp1_in4096_out128_p100_c100_3168fa.jsonl', output_details=True, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='/workspace/gpt-oss-120b', served_model_name=None, tokenizer=None, num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=100, output_file='./benchmark_results_tp8_dp1_A100/tp8_dp1_in4096_out128_p100_c100_3168fa.jsonl', output_details=True, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 209281
#Output tokens: 6108
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:00<01:21,  1.22it/s]
  2%|▏         | 2/100 [00:03<02:55,  1.79s/it]
 10%|█         | 10/100 [00:03<00:22,  4.08it/s]
 16%|█▌        | 16/100 [00:03<00:11,  7.26it/s]
 21%|██        | 21/100 [00:03<00:07, 10.43it/s]
 28%|██▊       | 28/100 [00:03<00:04, 15.26it/s]
 33%|███▎      | 33/100 [00:03<00:03, 19.01it/s]
 38%|███▊      | 38/100 [00:04<00:02, 21.36it/s]
 42%|████▏     | 42/100 [00:04<00:02, 22.11it/s]
 47%|████▋     | 47/100 [00:04<00:01, 26.60it/s]
 51%|█████     | 51/100 [00:04<00:01, 28.99it/s]
 57%|█████▋    | 57/100 [00:04<00:01, 35.39it/s]
 67%|██████▋   | 67/100 [00:04<00:00, 45.34it/s]
 75%|███████▌  | 75/100 [00:04<00:00, 52.44it/s]
 81%|████████  | 81/100 [00:04<00:00, 52.43it/s]
 88%|████████▊ | 88/100 [00:05<00:00, 55.27it/s]
 94%|█████████▍| 94/100 [00:05<00:00, 55.84it/s]
100%|██████████| 100/100 [00:05<00:00, 19.03it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 100       
Successful requests:                     100       
Benchmark duration (s):                  5.26      
Total input tokens:                      209281    
Total input text tokens:                 209281    
Total generated tokens:                  6108      
Total generated tokens (retokenized):    6104      
Request throughput (req/s):              19.00     
Input token throughput (tok/s):          39762.56  
Output token throughput (tok/s):         1160.50   
Peak output token throughput (tok/s):    3177.00   
Peak concurrent requests:                100       
Total token throughput (tok/s):          40923.06  
Concurrency:                             81.51     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   4290.34   
Median E2E Latency (ms):                 4453.07   
P90 E2E Latency (ms):                    5071.82   
P99 E2E Latency (ms):                    5219.03   
---------------Time to First Token----------------
Mean TTFT (ms):                          1529.33   
Median TTFT (ms):                        1276.58   
P99 TTFT (ms):                           3221.15   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          96.71     
Median TPOT (ms):                        46.64     
P99 TPOT (ms):                           836.67    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           45.96     
Median ITL (ms):                         18.40     
P95 ITL (ms):                            20.24     
P99 ITL (ms):                            1817.85   
Max ITL (ms):                            2559.31   
==================================================